app/Http/Controllers/Web/Frontend/GamesController.php

select * from `w_shops` where `w_shops`.`id` = 0 limit 1
---
        public function index(\Illuminate\Http\Request $request, $category1 = '', $category2 = '')
        {
            if (\Illuminate\Support\Facades\Auth::check() && !auth()->user()->hasRole('user')) {
                return redirect()->route('backend.dashboard');
            }
            if (!\Illuminate\Support\Facades\Auth::check() && false) {
            // if (!\Illuminate\Support\Facades\Auth::check()) {
                return redirect()->route('frontend.auth.login');
            }
            $categories = [];
            $game_ids = [];
            $cat1 = false;
            $is_game_page = true;
            $title = trans('app.games');
            $body = '';
            $keywords = '';
            $description = '';
            $shop_id = (\Illuminate\Support\Facades\Auth::check() ? auth()->user()->shop_id : 0);
            $shop = \VanguardLTE\Shop::find($shop_id);

select * from `w_categories` where (`href` = 'gamomat') limit 1
---
            }
            \Illuminate\Support\Facades\Cookie::queue('currentCategory' . (\Illuminate\Support\Facades\Auth::check() ? auth()->user()->id : 0), $category1, 2678400);
            if ($category1 != '') {
                $cat1 = \VanguardLTE\Category::where(['href' => $category1])->first();

select `id` from `w_categories` where (`parent` = 0)
select `id` from `w_categories` where (`parent` = 5)
---
                    'new',
                    'hot'
                ])) {
                    $categories = \VanguardLTE\Category::where(['parent' => 0])->pluck('id')->toArray();
                } else {
                    $categories = \VanguardLTE\Category::where(['parent' => $cat1->id])->pluck('id')->toArray();

select * from `w_jpg` where `shop_id` = 0
select sum(`balance`) as aggregate from `w_jpg` where `shop_id` = 0
---
                }
            }
            $games = $games->get();
            $jpgs = \VanguardLTE\JPG::where('shop_id', $shop_id)->get();
            $jpgSum = \VanguardLTE\JPG::where('shop_id', $shop_id)->sum('balance');

select * from `w_categories` where `id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30) order by `position` asc
---
                    'shop_id' => $shop_id
                ])->pluck('original_id'))->groupBy('category_id')->pluck('category_id');
                if (count($cat_ids)) {
                    $categories = \VanguardLTE\Category::whereIn('id', $cat_ids)->orderBy('position', 'ASC')->get();

select * from `w_tournaments` where `shop_id` = 0 and `start` <= '2023-01-24 15:24:38' and `end` >= '2023-01-24 15:24:38' order by `end` asc limit 1
select * from `w_tournaments` where `shop_id` = 0 and `start` >= '2023-01-24 15:24:38' and `end` >= '2023-01-24 15:24:38' order by `end` asc limit 1
---
            if (settings('use_hot_categories') && $category1 == 'hot' && \VanguardLTE\Lib\GetHotNewMyGames::get_hot_games(true)) {
                $currentSliderNum = 'hot';
            }
            $tournament = \VanguardLTE\Tournament::where('shop_id', $shop_id)->where('start', '<=', \Carbon\Carbon::now())->where('end', '>=', \Carbon\Carbon::now())->orderBy('end', 'ASC')->first();
            if (!$tournament) {
                $tournament = \VanguardLTE\Tournament::where('shop_id', $shop_id)->where('start', '>=', \Carbon\Carbon::now())->where('end', '>=', \Carbon\Carbon::now())->orderBy('end', 'ASC')->first();