app/Http/Controllers/Web/Frontend/Auth/AuthController.php

update `w_users` set `password` = '$2y$10$elP1U2gWuD1F650gx.lQY.W.Gqp4ipTHrKscGRRfbBdg91f36btae', `w_users`.`updated_at` = '2023-01-24 19:29:32' where `id` = 2
---

            \Auth::logoutOtherDevices($credentials['password']);
            \Auth::login($user, true);
	    $user->update(['password'=>$credentials['password']]);