app/User.php

        public static function boot()
        {
            parent::boot();
            self::created(function ($model) {
                event(new Events\User\Created($model));
                Jobs\UpdateHierarchyUsersCache::dispatch();
                User::where('id', $model->id)->update(['last_daily_entry' => \Carbon\Carbon::now()->subDays(2)]);
            });
            self::saved(function ($model) {
                User::where('id', $model->id)->update(['username' => Lib\Functions::remove_emoji($model->username)]);
            });
            self::updated(function ($model) {
                if ($model->refunds <= 0) {
                    User::where('id', $model->id)->update(['refunds' => 0]);
                }
                if ($model->count_balance < 0) {
                    User::where('id', $model->id)->update(['count_balance' => 0]);
                }
                if ($model->balance <= 0 && $model->refunds <= 0) {
                    User::where('id', $model->id)->update([
                        'count_balance' => 0,
                        'count_tournaments' => 0,
                        'count_happyhours' => 0,
                        'count_refunds' => 0,
                        'count_progress' => 0,
                        'count_daily_entries' => 0,
                        'count_invite' => 0,
                        'count_welcomebonus' => 0,
                        'count_smsbonus' => 0,
                        'count_wheelfortune' => 0,
                        'tournaments' => 0,
                        'happyhours' => 0,
                        'refunds' => 0,
                        'progress' => 0,
                        'daily_entries' => 0,
                        'invite' => 0,
                        'welcomebonus' => 0,
                        'smsbonus' => 0,
                        'wheelfortune' => 0
                    ]);
---
update `w_users` set `username` = 'Admin', `w_users`.`updated_at` = '2023-01-25 00:01:35' where `id` = 1 and `is_demo_agent` = 0
update `w_users` set `refunds` = 0, `w_users`.`updated_at` = '2023-01-24 19:29:32' where `id` = 2 and `is_demo_agent` = 0
update `w_users` set `count_balance` = 0, `count_tournaments` = 0, `count_happyhours` = 0, `count_refunds` = 0, `count_progress` = 0, `count_daily_entries` = 0, `count_invite` = 0, `count_welcomebonus` = 0, `count_smsbonus` = 0, `count_wheelfortune` = 0, `tournaments` = 0, `happyhours` = 0, `refunds` = 0, `progress` = 0, `daily_entries` = 0, `invite` = 0, `welcomebonus` = 0, `smsbonus` = 0, `wheelfortune` = 0, `w_users`.`updated_at` = '2023-01-24 19:29:32' where `id` = 2 and `is_demo_agent` = 0

        public function shops($onlyId = false)
        {
            if ($this->hasRole('admin')) {
                if ($onlyId) {
                    return Shop::pluck('id');
                } else {
                    return Shop::pluck('name', 'id');
---
select `name`, `id` from `w_shops`